Revit 2027 API
AnalysisDisplayDiagramSettings.OutlineColor Property
 Color of outline and fence lines in the diagram.
Namespace: Autodesk.Revit.DB.Analysis
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public Color OutlineColor { get; set; }
Public Property OutlineColor As Color
	Get
	Set
public:
property Color^ OutlineColor {
	Color^ get ();
	void set (Color^ value);
}
member OutlineColor : Color with get, set
Property Value
Color
Exceptions
Exception | Condition
ArgumentNullException |  When setting this property: A non-optional argument was null
See Also
Reference
AnalysisDisplayDiagramSettings Class
Autodesk.Revit.DB.Analysis Namespace